/* Note:Your choice is C IDE */
#include "stdio.h"
void main()
{
    //变量的使用
    
    //1、声明 （只声明变量名称，不给值）
    //int - 数据类型  a - 变量名称
    int a;
    
    //2、定义（声明+初始值）
    int b = 2;
    long c=243534;
    
    int d,e,f=2;//相同类型变量可以在一条语句中定义
    
   // a = 3;//(赋值:把3赋给a)
    
   // 3 = a;//(错误)
   
   // b = 1000000;//(正确，可以对已经初始化值的变量赋值)
   
  // c = 5 ;//(错误，不能给没有声明/定义的变量赋值)
    
    //无符号整型 unsigned int
    //短整型 short int
    //无符号短整型 unsigned short int
    //长整形：long int 
    //无符号长整型 unsigned long int
    
   //---------------------------------------------------------------
	
	//非数值
	//1、float 单精度浮点型
	float g1=1.2345566;
	
	//2、double 双精度浮点型
	double d1=0.24235345;

	
	
	//-----------------------------------
	//字符
	char c1='a'; 
	char c2='2'; //此时的2是字符型 不是数值型
}